Examinator/src/InformationRegisters/ДополнительныеМатериалыПользователейСУЗ/ДополнительныеМатериалыПользователейСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеМатериалыПользователейСУЗ</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Общий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроверки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверяющий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДополнительныеМатериалыПользователейСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Функция ТаблицаМатериалов(ТекущийПользователь, ЭлементСодержания=Неопределено, ЭлектронныйРесурс=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеМатериалыПользователейСУЗ.Период КАК Дата,
		|	ДополнительныеМатериалыПользователейСУЗ.Автор,
		|	ДополнительныеМатериалыПользователейСУЗ.ЭлементСодержания,
		|	ДополнительныеМатериалыПользователейСУЗ.СсылкаНаОбъектСУЗ,
		|	ДополнительныеМатериалыПользователейСУЗ.СсылкаНаОбъектСУЗ.Наименование КАК Наименование,
		|	ДополнительныеМатериалыПользователейСУЗ.Автор.Наименование КАК НаименованиеАвтора,
		|	ДополнительныеМатериалыПользователейСУЗ.Текст КАК Текст,
		|	ДополнительныеМатериалыПользователейСУЗ.ДатаИзменения КАК ДатаИзменения,
		|	ВЫБОР
		|		КОГДА ДополнительныеМатериалыПользователейСУЗ.Общий
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК Картинка,
		|	ДополнительныеМатериалыПользователейСУЗ.Общий
		|ИЗ
		|	РегистрСведений.ДополнительныеМатериалыПользователейСУЗ КАК ДополнительныеМатериалыПользователейСУЗ
		|ГДЕ
		|";

	Если ЭлементСодержания <> Неопределено Тогда		
		
		Запрос.Текст = Запрос.Текст + " ДополнительныеМатериалыПользователейСУЗ.ЭлементСодержания = &ЭлементСодержания И ";
		
		Запрос.УстановитьПараметр("ЭлементСодержания", ЭлементСодержания);
		
	КонецЕсли;	
	
	Если ЭлектронныйРесурс <> Неопределено Тогда		
		
		Запрос.Текст = Запрос.Текст + " (ДополнительныеМатериалыПользователейСУЗ.ЭлементСодержания.Владелец = &ЭлектронныйРесурс 
		| ИЛИ ДополнительныеМатериалыПользователейСУЗ.ЭлементСодержания = &ЭлектронныйРесурс) И ";
		
		Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);
		
	КонецЕсли;	
	
	Если Константы.ПоказыватьОбщиеДополнительныеМатериалыПослеПроверкиСУЗ.Получить() Тогда
		
		Запрос.Текст = Запрос.Текст + " (ДополнительныеМатериалыПользователейСУЗ.Автор = &ТекущийПользователь
		| ИЛИ (ДополнительныеМатериалыПользователейСУЗ.Общий = ИСТИНА
		| И ДополнительныеМатериалыПользователейСУЗ.Проверено = ИСТИНА))";
		
	Иначе
		
		Запрос.Текст = Запрос.Текст + " (ДополнительныеМатериалыПользователейСУЗ.Автор = &ТекущийПользователь
		| ИЛИ ДополнительныеМатериалыПользователейСУЗ.Общий = ИСТИНА)";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();
	
КонецФункции

Функция УдалитьМатериал(Знач Период, Знач ЭлементСодержания, ПроверятьПраваПрограммно=Ложь, Пользователь=Неопределено) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);	
	
	Если ПроверятьПраваПрограммно Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Если Пользователь = Неопределено Тогда
			Пользователь = Пользователи.ТекущийПользователь();
		КонецЕсли;		
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 1 Тогда
			
			Если НаборЗаписей[0].Автор = Пользователь ИЛИ Пользователи.ЭтоПолноправныйПользователь(Пользователь,,Ложь) Тогда
				НаборЗаписей.Очистить();				
			Иначе
				ВызватьИсключение НСтр("ru = 'Нарушение прав доступа'");
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецФункции

Функция ЗаписатьМатериал(Знач Период=Неопределено, Знач ЭлементСодержания, Знач Автор=Неопределено, Знач СсылкаНаОбъектСУЗ=Неопределено, Знач ТекущийПользователь=Неопределено, Знач Текст="", Знач Общий=Неопределено,  Знач ДатаИзменения=Неопределено, Знач АвтоПроверка=Истина) Экспорт
	
	// Получаем переменные
	
	Если ТекущийПользователь = Неопределено Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаИзменения) Тогда
		ДатаИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Автор <> ТекущийПользователь И НЕ Пользователи.ЭтоПолноправныйПользователь(ТекущийПользователь, Ложь, Ложь) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Записываем данные
	
	НаборЗаписей = РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.ЭлементСодержания.Установить(ЭлементСодержания);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		НоваяЗапись = НаборЗаписей.Добавить();
	Иначе
		
		НоваяЗапись = НаборЗаписей[0]; // Всегда есть одна запись
		
		Если НоваяЗапись.Автор <> Автор Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	НоваяЗапись.Период            = Период;
	НоваяЗапись.Автор             = Автор;
	НоваяЗапись.ЭлементСодержания = ЭлементСодержания;
	НоваяЗапись.СсылкаНаОбъектСУЗ = СсылкаНаОбъектСУЗ;
	НоваяЗапись.Текст             = Текст;
	НоваяЗапись.ДатаИзменения     = ДатаИзменения;
	
	Если Общий <> Неопределено Тогда
		НоваяЗапись.Общий = Общий;
	КонецЕсли;
	
	Если АвтоПроверка И Автор = ТекущийПользователь И ПравоДоступа("Редактирование", Метаданные.РегистрыСведений.ДополнительныеМатериалыПользователейСУЗ) Тогда
		
		// Если есть право редактирования регистра ДополнительныеМатериалыПользователейСУЗ,
		// То новый материал будет автоматически иметь статус "Проверено", чтобы не проверять
		// Его повторно через форму ДополнительныеМатериалыСУЗ.
		
		НоваяЗапись.Проверено    = Истина;
		НоваяЗапись.ДатаПроверки = ТекущаяДата();
		НоваяЗапись.Проверяющий  = ТекущийПользователь;
		
	Иначе
		
		НоваяЗапись.Проверено = Ложь; // При любом изменении устанавливаем, что запись не проверена.
		
	КонецЕсли;
	

	НаборЗаписей.Записать();
	
	// Возвращаем данные
	
	Информация = Новый Структура("
	|Автор,
	|Наименование,
	|Дата,
	|СсылкаНаОбъектСУЗ,
	|НаименованиеАвтора,
	|Картинка,
	|Общий,
	|Текст,
	|ЭлементСодержания,
	|ДатаИзменения",
	Автор,
	?(ЗначениеЗаполнено(СсылкаНаОбъектСУЗ), ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъектСУЗ, "Наименование"), Неопределено),
	Период,
	СсылкаНаОбъектСУЗ,
	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Автор, "Наименование"),
	?(НоваяЗапись.Общий, 0, 1),
	НоваяЗапись.Общий,
	Текст,
	ЭлементСодержания,
	ДатаИзменения);
								  
	Возврат Информация;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
